window.questions = [
  {
    t: '题目一：计算某财务数据1的结果',
    q: '已知某公司数据A:{A},数据B:{B},数据C:{C}，求数据D、E',
    a: '数据D: {D}\n数据E: {E}',
    calc: function ({ A, B, C }) {
      return {
        D: A + B,
        E: (B * C) / 100,
      }
    },
  },
  {
    t: '题目二：计算某财务数据2的结果',
    q: '已知某公司数据A:{A:[0.5,0.4,0.3]},数据B:{B}，\n选择数据D的正确答案',
    a: '数据D:{D:[1.1,1.2,1.3]}',
    calc: function ({ A, B }) {
      return {
        D: A * A - Math.sqrt(B),
      }
    },
  },
  {
    t: '题目三：计算某财务数据3的结果',
    q: '已知某公司数据A:{A:[0.1,2.0]},数据B:{B:[0.5,3.0]}，\n选择数据C的正确答案',
    a: '数据C:{C:[0.7,1.5,2.5,5.1]}',
    calc: function ({ A, B }) {
      return {
        C: A + B,
      }
    },
  },
]
